In [1]:
import pandas as pd
import numpy as np
from sklearn import preprocessing
import matplotlib.pyplot as plt

In [2]:
import os
os.chdir("C:\\Users\\MEDIA ENGINEER\\Desktop\\FE101\\Demo")

In [3]:
data = pd.read_csv('credit_demo.csv',na_values=['Missing','n/a','N/A','NA',""])

In [4]:
data.columns

Index(['ID', 'LIMIT_BAL', 'GENDER', 'EDUCATION', 'MARRIAGE', 'AGE',
       'PAY_HISTORY', 'BILL_AMT', 'PAY_AMT', 'default'],
      dtype='object')

In [5]:
data_train=data.sample(frac=0.80,random_state=200)
data_test=data.drop(data_train.index)

In [6]:
data_train.shape

(2393, 10)

In [ ]:
#Continuous Features

In [ ]:
data_train.columns

In [ ]:
#Feature Engineering

In [8]:
def get_limit(x):
      if 0<x<100000:
        return "LOW"
      elif 100000<=x<200000:
        return "MEDIUM"
      else:
            return "HIGH"

In [9]:
data_train['LIMIT']=data_train['LIMIT_BAL'].map(get_limit)

In [10]:
data_train.head()

,ID,LIMIT_BAL,GENDER,EDUCATION,MARRIAGE,AGE,PAY_HISTORY,BILL_AMT,PAY_AMT,default,LIMIT
93,94,50000,MALE,2,1,27.0,-1,1512.333333,962.166667,0,LOW
904,907,200000,MALE,1,2,27.0,-1,5489.500000,6346.666667,0,HIGH
599,601,100000,MALE,2,2,25.0,-1,585.666667,585.666667,0,MEDIUM
213,214,20000,FEMALE,1,2,26.0,-1,269.666667,614.500000,0,LOW
2157,2161,360000,MALE,2,1,37.0,-1,101140.500000,17417.833330,0,HIGH

In [11]:
pd.crosstab(data_train.default, data_train.LIMIT, margins=True)

LIMIT    HIGH  LOW  MEDIUM   All
default
0         908  262     427  1597
1         165  436     195   796
All      1073  698     622  2393

In [12]:
pd.crosstab(data_train.default, data_train.LIMIT, margins=True)/data.shape[0]

LIMIT        HIGH       LOW    MEDIUM       All
default
0        0.303577  0.087596  0.142762  0.533935
1        0.055165  0.145771  0.065196  0.266132
All      0.358743  0.233367  0.207957  0.800067

In [ ]:
#Age

In [13]:
# Replace Missing values 
data_train['AGE']=data_train['AGE'].fillna(data_train['AGE'].mean())
data_train.head()

,ID,LIMIT_BAL,GENDER,EDUCATION,MARRIAGE,AGE,PAY_HISTORY,BILL_AMT,PAY_AMT,default,LIMIT
93,94,50000,MALE,2,1,27.0,-1,1512.333333,962.166667,0,LOW
904,907,200000,MALE,1,2,27.0,-1,5489.500000,6346.666667,0,HIGH
599,601,100000,MALE,2,2,25.0,-1,585.666667,585.666667,0,MEDIUM
213,214,20000,FEMALE,1,2,26.0,-1,269.666667,614.500000,0,LOW
2157,2161,360000,MALE,2,1,37.0,-1,101140.500000,17417.833330,0,HIGH

In [ ]:
from sklearn.preprocessing import Imputer
imp = Imputer(missing_values='NaN', strategy='mean', axis=0)
imp.fit(AGE)
X = pd.DataFrame(data_train = imp.transform(AGE))

In [15]:
data_train.loc[(data_train["AGE"]>70)]

,ID,LIMIT_BAL,GENDER,EDUCATION,MARRIAGE,AGE,PAY_HISTORY,BILL_AMT,PAY_AMT,default,LIMIT
252,253,260000,FEMALE,1,2,91.0,-1,1835.333333,1987.5,0,HIGH
264,265,330000,FEMALE,1,1,91.0,-1,365.000000,8694.0,0,HIGH

In [16]:
avg =data_train['AGE'].mean()

In [17]:
data_train.loc[(data_train["AGE"]>70), 'AGE'] = avg

In [18]:
data_train.AGE.describe()

count    2393.000000
mean       36.581397
std         9.047168
min        21.000000
25%        29.000000
50%        36.000000
75%        42.000000
max        69.000000
Name: AGE, dtype: float64

In [19]:
def get_age(x):
      if 20<x<29:
        return "lessthan30"
      elif 29<=x<35:
        return "betw29-35"
      elif 35<=x<45:
        return "betw35-45"
      else:
            return "morethan45"

In [20]:
age_bkt=data['AGE'].map(get_age)

In [21]:
pd.crosstab(data_train.default, age_bkt, margins=True)/data.shape[0]

AGE      betw29-35  betw35-45  lessthan30  morethan45       All
default
0.0       0.140756   0.195921    0.095955    0.101304  0.533935
1.0       0.058509   0.075560    0.070545    0.061518  0.266132
All       0.199264   0.271481    0.166499    0.162822  0.800067

In [ ]:
#Bill Amount

In [22]:
def get_billamt(x):
      if x<5000:
        return "LOW"
      elif 5000<=x<20000:
        return "MEDIUM"
      else:
            return "HIGH"

In [23]:
data_train['bill_bkt']=data_train['BILL_AMT'].map(get_billamt)

In [24]:
pd.crosstab(data_train.default, data_train['bill_bkt'], margins=True)

bill_bkt  HIGH   LOW  MEDIUM   All
default
0          114  1033     450  1597
1          442   196     158   796
All        556  1229     608  2393

In [ ]:
# Pay Amount

In [25]:
def get_payamt(x):
      if x<833:
        return "LOW"
      elif 833<=x<5281:
        return "MEDIUM"
      else:
            return "HIGH"

In [26]:
data_train['pay_bkt']=data_train['PAY_AMT'].map(get_payamt)

In [27]:
pd.crosstab(data_train.default, data_train['pay_bkt'], margins=True)

pay_bkt  HIGH  LOW  MEDIUM   All
default
0         524  365     708  1597
1          75  227     494   796
All       599  592    1202  2393

In [28]:
data_train.head()

,ID,LIMIT_BAL,GENDER,EDUCATION,MARRIAGE,AGE,PAY_HISTORY,BILL_AMT,PAY_AMT,default,LIMIT,bill_bkt,pay_bkt
93,94,50000,MALE,2,1,27.0,-1,1512.333333,962.166667,0,LOW,LOW,MEDIUM
904,907,200000,MALE,1,2,27.0,-1,5489.500000,6346.666667,0,HIGH,MEDIUM,HIGH
599,601,100000,MALE,2,2,25.0,-1,585.666667,585.666667,0,MEDIUM,LOW,LOW
213,214,20000,FEMALE,1,2,26.0,-1,269.666667,614.500000,0,LOW,LOW,LOW
2157,2161,360000,MALE,2,1,37.0,-1,101140.500000,17417.833330,0,HIGH,HIGH,HIGH

In [ ]:
#Gender

In [29]:
data_train["GENDER"] = data_train["GENDER"].map(lambda x: 1 if x=='MALE' else 0)

In [30]:
data_train.head(6)

,ID,LIMIT_BAL,GENDER,EDUCATION,MARRIAGE,AGE,PAY_HISTORY,BILL_AMT,PAY_AMT,default,LIMIT,bill_bkt,pay_bkt
93,94,50000,1,2,1,27.0,-1,1512.333333,962.166667,0,LOW,LOW,MEDIUM
904,907,200000,1,1,2,27.0,-1,5489.500000,6346.666667,0,HIGH,MEDIUM,HIGH
599,601,100000,1,2,2,25.0,-1,585.666667,585.666667,0,MEDIUM,LOW,LOW
213,214,20000,0,1,2,26.0,-1,269.666667,614.500000,0,LOW,LOW,LOW
2157,2161,360000,1,2,1,37.0,-1,101140.500000,17417.833330,0,HIGH,HIGH,HIGH
30,31,210000,0,1,2,31.0,-1,3021.666667,3331.500000,0,HIGH,LOW,MEDIUM

In [31]:
data_train["GENDER"].value_counts()

0    1488
1     905
Name: GENDER, dtype: int64

In [ ]:
#Education

In [37]:
data_train.drop(data_train.query("EDUCATION ==0 | EDUCATION > 3").index, inplace=True)

In [33]:
data_train.EDUCATION.unique()

array([2, 1, 3], dtype=int64)

In [34]:
def get_edu(x):
      if x==1:
        return "GRADUATE"
      elif x==2:
        return "UNIV"
      else:
            return "HIGHSCHOOL"

In [36]:
data_train['EDU']=data_train['EDUCATION'].map(get_edu)

In [38]:
pd.crosstab(data_train.default, data_train.EDU, margins=True)/data_train.shape[0]

EDU      GRADUATE  HIGHSCHOOL      UNIV       All
default
0        0.349474    0.082526  0.232842  0.664842
1        0.093474    0.062737  0.178947  0.335158
All      0.442947    0.145263  0.411789  1.000000

In [ ]:
#MARRIAGE

In [39]:
data_train.drop(data_train.query("MARRIAGE ==0 | MARRIAGE > 2").index, inplace=True)

In [40]:
data_train.MARRIAGE.value_counts()

1    1246
2    1107
Name: MARRIAGE, dtype: int64

In [41]:
data_train["MARRIAGE"] = data_train["MARRIAGE"].map(lambda x: 1 if x==1 else 0)

In [ ]:
#Payhist

In [42]:
def get_payhist(x):
      if x==-2:
        return "left"
      elif x==-1:
        return "dulypaid"
      else:
            return "delinquent"

In [43]:
data_train['PAY_HISTORY']=data_train['PAY_HISTORY'].map(get_payhist)

In [44]:
pd.crosstab(data_train.default, data_train.PAY_HISTORY, margins=True)/data.shape[0]

PAY_HISTORY  delinquent  dulypaid      left       All
default
0              0.002340  0.522233  0.000334  0.524908
1              0.221999  0.000000  0.039786  0.261785
All            0.224340  0.522233  0.040120  0.786693

In [45]:
data_train.head()

,ID,LIMIT_BAL,GENDER,EDUCATION,MARRIAGE,AGE,PAY_HISTORY,BILL_AMT,PAY_AMT,default,LIMIT,bill_bkt,pay_bkt,EDU
93,94,50000,1,2,1,27.0,dulypaid,1512.333333,962.166667,0,LOW,LOW,MEDIUM,UNIV
904,907,200000,1,1,0,27.0,dulypaid,5489.500000,6346.666667,0,HIGH,MEDIUM,HIGH,GRADUATE
599,601,100000,1,2,0,25.0,dulypaid,585.666667,585.666667,0,MEDIUM,LOW,LOW,UNIV
213,214,20000,0,1,0,26.0,dulypaid,269.666667,614.500000,0,LOW,LOW,LOW,GRADUATE
2157,2161,360000,1,2,1,37.0,dulypaid,101140.500000,17417.833330,0,HIGH,HIGH,HIGH,UNIV

In [ ]:
#OneHotEncoding

In [46]:
data_final = pd.get_dummies(data_train, prefix = ['edu', 'pay_hist','limit', 'bill_bkt','pay_bkt'], columns=['EDU','PAY_HISTORY', 'LIMIT','bill_bkt','pay_bkt'])

In [47]:
data_final.head()

,ID,LIMIT_BAL,GENDER,EDUCATION,MARRIAGE,AGE,BILL_AMT,PAY_AMT,default,edu_GRADUATE,...,pay_hist_left,limit_HIGH,limit_LOW,limit_MEDIUM,bill_bkt_HIGH,bill_bkt_LOW,bill_bkt_MEDIUM,pay_bkt_HIGH,pay_bkt_LOW,pay_bkt_MEDIUM
93,94,50000,1,2,1,27.0,1512.333333,962.166667,0,0,...,0,0,1,0,0,1,0,0,0,1
904,907,200000,1,1,0,27.0,5489.500000,6346.666667,0,1,...,0,1,0,0,0,0,1,1,0,0
599,601,100000,1,2,0,25.0,585.666667,585.666667,0,0,...,0,0,0,1,0,1,0,0,1,0
213,214,20000,0,1,0,26.0,269.666667,614.500000,0,1,...,0,0,1,0,0,1,0,0,1,0
2157,2161,360000,1,2,1,37.0,101140.500000,17417.833330,0,0,...,0,1,0,0,1,0,0,1,0,0

In [48]:
data_final.columns

Index(['ID', 'LIMIT_BAL', 'GENDER', 'EDUCATION', 'MARRIAGE', 'AGE', 'BILL_AMT',
       'PAY_AMT', 'default', 'edu_GRADUATE', 'edu_HIGHSCHOOL', 'edu_UNIV',
       'pay_hist_delinquent', 'pay_hist_dulypaid', 'pay_hist_left',
       'limit_HIGH', 'limit_LOW', 'limit_MEDIUM', 'bill_bkt_HIGH',
       'bill_bkt_LOW', 'bill_bkt_MEDIUM', 'pay_bkt_HIGH', 'pay_bkt_LOW',
       'pay_bkt_MEDIUM'],
      dtype='object')

In [49]:
datac = data_train[['LIMIT_BAL','AGE','BILL_AMT','PAY_AMT']]
datac.corr(method='pearson')

           LIMIT_BAL       AGE  BILL_AMT   PAY_AMT
LIMIT_BAL   1.000000  0.205235  0.031369  0.312325
AGE         0.205235  1.000000  0.045739  0.068483
BILL_AMT    0.031369  0.045739  1.000000  0.256606
PAY_AMT     0.312325  0.068483  0.256606  1.000000